InformationRegisters/ОбъектыПривязка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>ОбъектыПривязка</Name>
			<Comment>Привязка объектов к элементам предприятия</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Владелец</Name>
					<Comment>Владелец объекта</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Предприятие</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТелМобильные</v8:Type>
						<v8:Type>cfg:CatalogRef.ТелОчереди</v8:Type>
						<v8:Type>cfg:CatalogRef.ТелВнутренние</v8:Type>
						<v8:Type>cfg:CatalogRef.ТелВнешние</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОбъектыПривязка/Ext/ManagerModule.bsl
Функция ВнутреннийТелефонСотрудника(Сотрудник) Экспорт	
	
	Если Не ЗначениеЗаполнено(Сотрудник) Тогда
		Возврат ""
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1 Т.Объект.Код КАК НомерВнутреннегоТелефона ИЗ РегистрСведений.ОбъектыПривязка КАК Т ГДЕ Т.Владелец = &Владелец И Т.Объект ССЫЛКА Справочник.ТелВнутренние";	
	Запрос.УстановитьПараметр("Владелец", Сотрудник	);		
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат ""
	КонецЕсли;
	Возврат РезультатЗапроса.Выгрузить()[0][0];
КонецФункции
